Revit 2027 API
AreaBasedLoadBoundaryLineData.TopLevelId Property
 The top level id of the area based load boundary line.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TopLevelId { get; set; }
Public Property TopLevelId As ElementId
	Get
	Set
public:
property ElementId^ TopLevelId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TopLevelId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The ElementId levelId cannot be used as the top level. The ElementId levelId is not a Level or it's elevation is lower than the bottom level's elevation.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The top level's elevation cannot be lower than the bottom level.
See Also
Reference
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace